# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Text-based UI library
brew "ncurses"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Console Matrix
brew "cmatrix"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Infamous electronic fortune-cookie generator
brew "fortune"
# GNU compiler collection
brew "gcc"
# Installer for the general purpose language Haskell
brew "ghcup"
# Distributed revision control system
brew "git"
# Tool for glamorous shell scripts
brew "gum"
# Grammar Checker for Developers
brew "harper"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Synchronize time with remote web servers
brew "htpdate"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Library to render SVG files using Cairo
brew "librsvg"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Next-gen compiler infrastructure
brew "llvm"
# LLVM Project Linker
brew "lld"
# Language Server Protocol for Markdown
brew "marksman"
# Fast, highly customisable system info script
brew "neofetch"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Object-relational database system
brew "postgresql@18", link: true
# Command driven spotify player
brew "spotify_player"
# Cross-shell prompt for astronauts
brew "starship"
# Implementation of the Language Server Protocol for LaTeX
brew "texlab"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Terminal-based Tetris clone
brew "vitetris"
# Unicode-aware word processor that runs in a terminal
brew "wordgrinder"
# UNIX shell (command interpreter)
brew "zsh"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
# cask "basictex"
# Text and code editor
# cask "chime"
# Web browser
# cask "firefox"
# cask "font-abril-fatface"
# cask "font-aladin"
# cask "font-aldrich"
# cask "font-alegreya"
# cask "font-alegreya-sc"
# cask "font-alfa-slab-one"
# cask "font-alike-angular"
# cask "font-allerta"
# cask "font-allerta-stencil"
# cask "font-amiri"
# cask "font-ancizar-serif"
# cask "font-anta"
# cask "font-arbutus-slab"
# cask "font-aref-ruqaa"
# cask "font-averia-serif-libre"
# cask "font-babylonica"
# cask "font-barriecito"
# cask "font-baskervville-sc"
# cask "font-benne"
# cask "font-bitcount-prop-single-ink"
# cask "font-biz-udmincho"
# cask "font-bodoni-moda-sc"
# cask "font-bruno-ace"
# cask "font-brygada-1918"
# cask "font-bungee-hairline"
# cask "font-charmonman"
# cask "font-chokokutai"
# cask "font-cinzel-decorative"
# cask "font-codystar"
# cask "font-cormorant-garamond"
# cask "font-courier-prime"
# cask "font-crimson-text"
# cask "font-cutive-mono"
# cask "font-dancing-script"
# cask "font-doto"
# cask "font-eagle-lake"
# cask "font-eb-garamond"
# cask "font-eczar"
# cask "font-emblema-one"
# cask "font-enriqueta"
# cask "font-ephesis"
# cask "font-estonia"
# cask "font-fjord-one"
# cask "font-fleur-de-leah"
# cask "font-fredericka-the-great"
# cask "font-gabriela"
# cask "font-gentium-book-plus"
# cask "font-geostar"
# cask "font-gfs-didot"
# cask "font-gfs-neohellenic"
# cask "font-gideon-roman"
# cask "font-goudy-bookletter-1911"
# cask "font-grandiflora-one"
# cask "font-grenze-gotisch"
# cask "font-griffy"
# cask "font-gugi"
# cask "font-gwendolyn"
# cask "font-hahmlet"
# cask "font-hina-mincho"
# cask "font-im-fell-double-pica"
# cask "font-im-fell-dw-pica"
# cask "font-im-fell-dw-pica-sc"
# cask "font-im-fell-english"
# cask "font-im-fell-english-sc"
# cask "font-im-fell-french-canon"
# cask "font-im-fell-french-canon-sc"
# cask "font-im-fell-great-primer"
# cask "font-im-fell-great-primer-sc"
# cask "font-inknut-antiqua"
# cask "font-jacquard-12-charted"
# cask "font-jim-nightshade"
# cask "font-katibeh"
# cask "font-kotta-one"
# cask "font-kreon"
# cask "font-kurale"
# cask "font-labrada"
# cask "font-lateef"
# cask "font-libertinus"
# cask "font-libertinus-keyboard"
# cask "font-libertinus-math"
# cask "font-libertinus-mono"
# cask "font-libertinus-serif"
# cask "font-libertinus-serif-display"
# cask "font-libre-baskerville"
# cask "font-lugrasimo"
# cask "font-major-mono-display"
# cask "font-maname"
# cask "font-manufacturing-consent"
# cask "font-markazi-text"
# cask "font-megrim"
# cask "font-metamorphous"
# cask "font-milonga"
cask "font-monaspice-nerd-font"
# cask "font-mr-de-haviland"
# cask "font-mrs-saint-delafield"
# cask "font-neuton"
# cask "font-new-tegomin"
# cask "font-noto-serif"
# cask "font-orbitron"
# cask "font-pirata-one"
# cask "font-pixelify-sans"
# cask "font-plaster"
# cask "font-platypi"
# cask "font-playfair"
# cask "font-playfair-display-sc"
# cask "font-port-lligat-slab"
# cask "font-press-start-2p"
# cask "font-protest-guerrilla"
# cask "font-quando"
# cask "font-quintessential"
# cask "font-rakkas"
# cask "font-roboto"
# cask "font-rubik-broken-fax"
# cask "font-ruwudu"
# cask "font-sahitya"
# cask "font-saira-stencil-one"
# cask "font-sankofa-display"
# cask "font-sansita"
# cask "font-savate"
# cask "font-sawarabi-mincho"
# cask "font-secular-one"
# cask "font-shippori-mincho"
# cask "font-simonetta"
# cask "font-sixtyfour"
# cask "font-sixtyfour-convergence"
# cask "font-solway"
# cask "font-sorts-mill-goudy"
# cask "font-special-elite"
# cask "font-spinnaker"
# cask "font-stalinist-one"
# cask "font-stardos-stencil"
# cask "font-stix-two-math"
# cask "font-syne-mono"
# cask "font-tagesschrift"
# cask "font-tektur"
# cask "font-trykker"
# cask "font-uncial-antiqua"
# cask "font-unifrakturmaguntia"
# cask "font-vesper-libre"
# cask "font-volkhov"
# cask "font-vollkorn"
# cask "font-vt323"
# cask "font-wallpoet"
# cask "font-young-serif"
# cask "font-yrsa"
# cask "font-ysabeau-infant"
# cask "font-yuji-syuku"
# cask "font-zen-antique"
# cask "font-zen-antique-soft"
# cask "font-zen-dots"
# cask "font-zen-old-mincho"
# cask "font-zen-tokyo-zoo"
# Web browser
cask "google-chrome"
# Instant messaging application focusing on security
# cask "signal"
# App for making risograph prints
# cask "spectrolite"
# Music streaming service
cask "spotify"
# Configurable document editor that supports Markdown
# cask "typora"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
