brew "bash"
brew "chezmoi"
brew "ghcup"
brew "git"
brew "harper"
brew "helix"
brew "marksman"
brew "neofetch"
brew "pipes-sh"
brew "postgresql@18", link: true
brew "starship"
brew "tmux"
brew "zsh"
cask "font-monaspice-nerd-font"
cask "spotify"
cask "wezterm"
